#   Условие
#   Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.

#   Запрашиваем числа
a = int(input())
b = int(input())
c = int(input())

#   Выводим сумму чисел
print(a + b + c)
