#   Условие
#   Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое
# число записано в отдельной строке.

#   Запрашиваем данные
b = int(input())
h = int(input())

#   Выводим площадь
print(b * h / 2)