#   Условие
#   Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по
#   образцу:

#   Запрашиваем имя
Name = input()

#   Выводим
print ('Hello, ' + str(Name) + '!')
