#   Условие
#   Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы
#   важны!).

#   Запрашиваем число
n = int(input())

#   Выводим
print ("The next number for the number " + str(n) + " is " + str(n + 1))
print ("The previous number for the number " + str(n) + " is " + str(n - 1))
