#   Условие
#   Дана строка. Удалите из этой строки все символы @.

#   Получаем данные
s = input()

#   Выдаем ответ
print(s.replace('@', ''))