#   Условие
#   Дана строка. Замените в этой строке все цифры 1 на слово one.

#   Получаем данные
s = input()

#   Выдаем ответ
print(s.replace('1', 'one'))
