#   Условие
#   Дано натуральное число. Выведите его последнюю цифру.

#   Получаем данные
x = int(input())

#   Выдаем ответ
print(str(x % 10))
