#   Условие
#   Дано положительное действительное число X. Выведите его дробную часть.

#   Получаем данные
x = float(input())

#   Выдаем ответ
print(str(x % 1))
